app/controllers/api/v1/users_controller.rb

  def index

    # local variable suffices because we dont use view and we dont
    #   need to pass anything to a view.
    users = User.all
---
SELECT "users".* FROM "users"

  def show
    user = User.where(params[:id])

    if user.empty?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]