applicanttracking/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "middle_name", "last_name", "phone", "email", "street_address", "city", "state", "country", "zipcode", "submitted", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Hanna"], ["updated_at", "2016-12-02 22:00:16.957138"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)